[NoCoverage] BlockStatement
src/StaticData/auth/auth.controller.ts:11:45
   constructor(private readonly authService: AuthService) {}
 
   @Post('register')
-  async register(@Body() data: RegisterDto) {
-    return this.authService.register(data);
-  }
+  async register(@Body() data: RegisterDto) {}
 
   @Post('login')

[NoCoverage] BlockStatement
src/StaticData/auth/auth.controller.ts:16:39
   }
 
   @Post('login')
-  async login(@Body() data: LoginDto) {
-    return this.authService.login(data);
-  }
+  async login(@Body() data: LoginDto) {}
 }
 
