[Timeout] BlockStatement
src/StaticData/auth/auth.service.ts:19:57
     private jwtService: JwtService,
   ) {}
 
-  private generateTokens(userId: string, email: string) {
-    const payload = { sub: userId, email };
-
-    return {
-      accessToken: this.jwtService.sign(payload),
-      refreshToken: this.jwtService.sign(payload, { expiresIn: '30d' }),
-    };
-  }
+  private generateTokens(userId: string, email: string) {}
 
   async register(data: RegisterDto) {

[Timeout] ObjectLiteral
src/StaticData/auth/auth.service.ts:20:21
   ) {}
 
   private generateTokens(userId: string, email: string) {
-    const payload = { sub: userId, email };
+    const payload = {};
 
     return {

[Timeout] ObjectLiteral
src/StaticData/auth/auth.service.ts:22:12
   private generateTokens(userId: string, email: string) {
     const payload = { sub: userId, email };
 
-    return {
-      accessToken: this.jwtService.sign(payload),
-      refreshToken: this.jwtService.sign(payload, { expiresIn: '30d' }),
-    };
+    return {};
   }
 

[Timeout] StringLiteral
src/StaticData/auth/auth.service.ts:24:64
 
     return {
       accessToken: this.jwtService.sign(payload),
-      refreshToken: this.jwtService.sign(payload, { expiresIn: '30d' }),
+      refreshToken: this.jwtService.sign(payload, { expiresIn: "" }),
     };
   }

[Survived] ObjectLiteral
src/StaticData/auth/auth.service.ts:42:13
     const hashedPassword = await bcrypt.hash(data.password, 10);
 
     const user = await this.prisma.user.create({
-      data: {
-        username: data.username || '',
-        email: data.email,
-        password: hashedPassword,
-        isStaff: false,
-      },
+      data: {},
       select: {
         id: true,

[Survived] ConditionalExpression
src/StaticData/auth/auth.service.ts:43:19
 
     const user = await this.prisma.user.create({
       data: {
-        username: data.username || '',
+        username: true,
         email: data.email,
         password: hashedPassword,

[Survived] ConditionalExpression
src/StaticData/auth/auth.service.ts:43:19
 
     const user = await this.prisma.user.create({
       data: {
-        username: data.username || '',
+        username: false,
         email: data.email,
         password: hashedPassword,

[Survived] BooleanLiteral
src/StaticData/auth/auth.service.ts:46:18
         username: data.username || '',
         email: data.email,
         password: hashedPassword,
-        isStaff: false,
+        isStaff: true,
       },
       select: {

[Survived] BooleanLiteral
src/StaticData/auth/auth.service.ts:51:16
       select: {
         id: true,
         username: true,
-        email: true,
+        email: false,
         isStaff: true,
         profile: true,

[Survived] BooleanLiteral
src/StaticData/auth/auth.service.ts:52:18
         id: true,
         username: true,
         email: true,
-        isStaff: true,
+        isStaff: false,
         profile: true,
       },

[Survived] BooleanLiteral
src/StaticData/auth/auth.service.ts:53:18
         username: true,
         email: true,
         isStaff: true,
-        profile: true,
+        profile: false,
       },
     });

[Survived] BooleanLiteral
src/StaticData/auth/auth.service.ts:69:27
   async login(data: LoginDto) {
     const user = await this.prisma.user.findUnique({
       where: { email: data.email },
-      include: { profile: true },
+      include: { profile: false },
     });
 

[Killed] ConditionalExpression
src/StaticData/auth/auth.service.ts:78:9
 
     const isPasswordValid = await bcrypt.compare(data.password, user.password);
 
-    if (!isPasswordValid) {
+    if (true) {
       throw new UnauthorizedException('Invalid credentials');
     }
killedBy: AuthService login should return tokens for valid credentials
statusReason: UnauthorizedException: Invalid credentials

[Killed] BlockStatement
src/StaticData/auth/auth.service.ts:78:27
 
     const isPasswordValid = await bcrypt.compare(data.password, user.password);
 
-    if (!isPasswordValid) {
-      throw new UnauthorizedException('Invalid credentials');
-    }
+    if (!isPasswordValid) {}
 
     const { password, ...userWithoutPassword } = user;
killedBy: AuthService login should throw UnauthorizedException for invalid password
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": undefined, "message": "Login successful", "refreshToken": undefined, "user": {"email": "test@test.com", "id": "1"}}
